# -*- coding: utf-8 -*-
"""HW_09.ipynb

Automatically generated by Colaboratory.

Original file is located at
    https://colab.research.google.com/drive/1D946yGQqjLjY_UsroJt2XTn4DxNAtuJ1

Задача 40: Работать с файлом california_housing_train.csv, который находится в папке sample_data. Определить среднюю стоимость дома, где кол-во людей от 0 до 500 (population).

Задача 42: Узнать какая максимальная households в зоне минимального значения population.
"""

import pandas as pd

data = pd.read_csv('/content/sample_data/california_housing_train.csv')

print(data.head())

"""Определить среднюю стоимость дома, где кол-во людей от 0 до 500 (population)"""

print(data.tail())

mean_value = data['median_house_value'][data['population'] < 500].mean().round(2)
print(mean_value)

"""Задача 42: Узнать какая максимальная households в зоне минимального значения population."""

households_max = data['households'][data['population'].min() == data['population']].max()
print(households_max)